Tekla.Structures.Internal.dotIdentifierToGUID_t
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotIdentifierToGUID_t.Identifier
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotIdentifierToGUID_t.GUID
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotIdentifierToGUID_t.GetIdentifierByGUID(System.String)
Returns an identifier instance that has the given GUID in the model.
GUID: The GUID to look for in the model.
Returns: The identifier of the GUID, with empty values if not found.

Tekla.Structures.Internal.dotIdentifierToGUID_t.GetGUIDByIdentifier(Tekla.Structures.Identifier)
Returns the GUID of the given identifier instance.
Returns: The GUID of the identifier.